In [1]:
import pandas as pd
data = {'Name': ['kavi', 'anuj','raj','gautham','reena','ram'],
        'Age': [20,21,19,20,22,23],
        'Gender': ['F','M','M','M','F','M'],
        'Marks': [56,65,'NaN',75,82,99]}
df = pd.DataFrame(data)
df

      Name  Age Gender Marks
0     kavi   20      F    56
1     anuj   21      M    65
2      raj   19      M   NaN
3  gautham   20      M    75
4    reena   22      F    82
5      ram   23      M    99

In [2]:
df['Gender']=df['Gender'].map({'M':0,'F':1,}).astype(float)
df

      Name  Age  Gender Marks
0     kavi   20     1.0    56
1     anuj   21     0.0    65
2      raj   19     0.0   NaN
3  gautham   20     0.0    75
4    reena   22     1.0    82
5      ram   23     0.0    99

In [3]:
df.filter(['Name'])

      Name
0     kavi
1     anuj
2      raj
3  gautham
4    reena
5      ram

In [4]:
df.filter(['Marks'])

  Marks
0    56
1    65
2   NaN
3    75
4    82
5    99

In [5]:
df[df['Age']==20]

      Name  Age  Gender Marks
0     kavi   20     1.0    56
3  gautham   20     0.0    75

In [6]:
#Merging the data
S_details=pd.DataFrame({
    'ID':[11,12,13,14,15,16,17,18,19,20],
    'Name':['Rahul','ravi','vishnu','nokesh','hari','vasu','raj','gautham','reena','ram'],
    'Branch':['Soas','Soas','Soas','Soas','Soas','Soas','Soas','Soas','Soas','Soas',]})
print(S_details)

   ID     Name Branch
0  11    Rahul   Soas
1  12     ravi   Soas
2  13   vishnu   Soas
3  14   nokesh   Soas
4  15     hari   Soas
5  16     vasu   Soas
6  17      raj   Soas
7  18  gautham   Soas
8  19    reena   Soas
9  20      ram   Soas

In [7]:
Fee_status=pd.DataFrame({
    'ID':[11,12,13,14,15,16,17,18,19,20],
    'Paid':['5000','2000','4000','3000','4000','5000','6000','7000','8000','9000']})
print(Fee_status)

   ID  Paid
0  11  5000
1  12  2000
2  13  4000
3  14  3000
4  15  4000
5  16  5000
6  17  6000
7  18  7000
8  19  8000
9  20  9000

In [8]:
print(pd.merge(S_details,Fee_status,on='ID'))

   ID     Name Branch  Paid
0  11    Rahul   Soas  5000
1  12     ravi   Soas  2000
2  13   vishnu   Soas  4000
3  14   nokesh   Soas  3000
4  15     hari   Soas  4000
5  16     vasu   Soas  5000
6  17      raj   Soas  6000
7  18  gautham   Soas  7000
8  19    reena   Soas  8000
9  20      ram   Soas  9000

In [9]:
#reshaping the data
import numpy as np
array1=np.arange(8)
print("orginal array:\n",array1)

orginal array:
 [0 1 2 3 4 5 6 7]

In [10]:
array2=np.arange(8).reshape(2,4)
print("\n array reshaped with 2 rows and 4 columns:\n",array2)

 array reshaped with 2 rows and 4 columns:
 [[0 1 2 3]
 [4 5 6 7]]

In [11]:
array3=np.arange(8).reshape(4,2)
print("\n array reshaped with 4 rows and 2 columns:\n",array3)

 array reshaped with 4 rows and 2 columns:
 [[0 1]
 [2 3]
 [4 5]
 [6 7]]

In [12]:
array4=np.arange(8).reshape(2,2,2)
print("\n orginal array reshaped with 4 rows and 3D:\n",array4)

 orginal array reshaped with 4 rows and 3D:
 [[[0 1]
  [2 3]]

 [[4 5]
  [6 7]]]

In [3]:
import pandas as pd
import numpy as np

In [4]:
df=pd.read_csv("q1_dataset.csv")
df

     Age Occupation Location  Gender
0     54     Artist     City    Male
1     21     Doctor     City  Female
2     76   Engineer    Rural  Female
3     53     Artist   Suburb    Male
4     45     Doctor    Rural  Female
..   ...        ...      ...     ...
495   78    Teacher   Suburb    Male
496   23   Engineer   Suburb  Female
497   63   Engineer   Suburb    Male
498   36     Artist   Suburb  Female
499   27   Engineer   Suburb    Male

[500 rows x 4 columns]

In [20]:
df.head()

   Age Occupation Location  Gender
0   54     Artist     City    Male
1   21     Doctor     City  Female
2   76   Engineer    Rural  Female
3   53     Artist   Suburb    Male
4   45     Doctor    Rural  Female

In [5]:
df.tail()

     Age Occupation Location  Gender
495   78    Teacher   Suburb    Male
496   23   Engineer   Suburb  Female
497   63   Engineer   Suburb    Male
498   36     Artist   Suburb  Female
499   27   Engineer   Suburb    Male

In [11]:
#how many observations
num_obesrvations=len(df)
print(f"there are {num_obesrvations} obesravations in the dataset.")

there are 500 obesravations in the dataset.

In [10]:
#how many features
num_features=len(df.columns)
print(f"there are {num_features} obesravations in the dataset.")

there are 4 obesravations in the dataset.

In [12]:
#different occupations
n_occupations= df['Occupation'].unique()
n_occupations

array(['Artist', 'Doctor', 'Engineer', 'Teacher'], dtype=object)

In [13]:
n_occupations= df['Occupation'].nunique()
n_occupations

4

In [14]:
most_common_occupation= df['Occupation'].mode()[0]
print(f"the most_common_occupation is:{most_common_occupation}")

the most_common_occupation is:Artist

In [17]:
average_age=df['Age'].mean()
print(f"the average is:{average_age:.2f}")

the average is:48.51

In [18]:
average_age_per_occupation=df.groupby('Occupation')['Age'].mean()
print("Average age of the people in each occupation in group")
print(average_age_per_occupation)

Average age of the people in each occupation in group
Occupation
Artist      49.475862
Doctor      48.254098
Engineer    49.142857
Teacher     47.024793
Name: Age, dtype: float64